## Data Indexing and Selection

In [2]:
import pandas as pd

In [3]:
Student_data={
    'Names':['Jhon','Alice','Bob','Ben','Srock'],
    'Science':[56,65,77,23,78],
    'Maths':[22,34,22,76,11],
    'English':[33,44,56,73,74]
}
df=pd.DataFrame(Student_data,index=['a','b','c','d','e'])
df

   Names  Science  Maths  English
a   Jhon       56     22       33
b  Alice       65     34       44
c    Bob       77     22       56
d    Ben       23     76       73
e  Srock       78     11       74

In [4]:
Math_scores=df['Maths']
Math_scores

a    22
b    34
c    22
d    76
e    11
Name: Maths, dtype: int64

In [5]:
Science_marks=df.Science
Science_marks

a    56
b    65
c    77
d    23
e    78
Name: Science, dtype: int64

In [6]:
df.iloc[2]

Names      Bob
Science     77
Maths       22
English     56
Name: c, dtype: object

In [7]:
df[0:4:2]

  Names  Science  Maths  English
a  Jhon       56     22       33
c   Bob       77     22       56

In [8]:
df.loc['a':'c':,'Maths']

a    22
b    34
c    22
Name: Maths, dtype: int64

In [9]:
df

   Names  Science  Maths  English
a   Jhon       56     22       33
b  Alice       65     34       44
c    Bob       77     22       56
d    Ben       23     76       73
e  Srock       78     11       74

In [10]:
df[df.Maths>40]

  Names  Science  Maths  English
d   Ben       23     76       73

In [11]:
df.bool=df[(df.Maths>20) & (df.Science<60)]
df.bool

  Names  Science  Maths  English
a  Jhon       56     22       33
d   Ben       23     76       73

In [12]:
df.isin(['Ben'])

   Names  Science  Maths  English
a  False    False  False    False
b  False    False  False    False
c  False    False  False    False
d   True    False  False    False
e  False    False  False    False

In [15]:
df

   Names  Science  Maths  English
a   Jhon       56     22       33
b  Alice       65     34       44
c    Bob       77     22       56
d    Ben       23     76       73
e  Srock       78     11       74

In [21]:
df.where(df.Science<30)

  Names  Science  Maths  English
a   NaN      NaN    NaN      NaN
b   NaN      NaN    NaN      NaN
c   NaN      NaN    NaN      NaN
d   Ben     23.0   76.0     73.0
e   NaN      NaN    NaN      NaN